In [1]:
import pandas as pd

In [67]:
d1={'Mahindra':{'2014-2015':6500,'2015-2016':7000,'2016-2017':5600,'2017-2018':3500,'2018-2019':2000,'2019-2020':4450}
  }

In [68]:
d1

{'Mahindra': {'2014-2015': 6500,
  '2015-2016': 7000,
  '2016-2017': 5600,
  '2017-2018': 3500,
  '2018-2019': 2000,
  '2019-2020': 4450}}

In [69]:
df=pd.DataFrame(d1)
df

           Mahindra
2014-2015      6500
2015-2016      7000
2016-2017      5600
2017-2018      3500
2018-2019      2000
2019-2020      4450

In [70]:
df.describe()

          Mahindra
count     6.000000
mean   4841.666667
std    1898.003337
min    2000.000000
25%    3737.500000
50%    5025.000000
75%    6275.000000
max    7000.000000

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 2014-2015 to 2019-2020
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Mahindra  6 non-null      int64
dtypes: int64(1)
memory usage: 96.0+ bytes

In [72]:
df.columns

Index(['Mahindra'], dtype='object')

In [73]:
df.index

Index(['2014-2015', '2015-2016', '2016-2017', '2017-2018', '2018-2019',
       '2019-2020'],
      dtype='object')

In [74]:
df.columns.values

array(['Mahindra'], dtype=object)

In [75]:
df['Mean']='4841.666667'

In [76]:
df

           Mahindra         Mean
2014-2015      6500  4841.666667
2015-2016      7000  4841.666667
2016-2017      5600  4841.666667
2017-2018      3500  4841.666667
2018-2019      2000  4841.666667
2019-2020      4450  4841.666667

In [79]:
df['Mean difference square']=(df['Mahindra']-df['Mean'])**2
#df['mean difference square']=(df['Monthly milk production']-df['mean'])**2

TypeError: unsupported operand type(s) for -: 'int' and 'str'

In [126]:
df_currency=pd.DataFrame([1,2,3,4,5,6,7,8,9,10],columns=['Dollars'])
df_currency['INR']=df_currency*73
df_currency

   Dollars  INR
0        1   73
1        2  146
2        3  219
3        4  292
4        5  365
5        6  438
6        7  511
7        8  584
8        9  657
9       10  730

In [81]:
df_currency.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Dollars  10 non-null     int64
 1   INR      10 non-null     int64
dtypes: int64(2)
memory usage: 288.0 bytes

In [118]:
df_currency.describe()

        Dollars         INR
count  10.00000   10.000000
mean    5.50000  401.500000
std     3.02765  221.018476
min     1.00000   73.000000
25%     3.25000  237.250000
50%     5.50000  401.500000
75%     7.75000  565.750000
max    10.00000  730.000000

In [128]:
df_currency.columns

Index(['Dollars', 'INR'], dtype='object')

In [135]:
import numpy as np
#mean difference sqaure
df_currency['dollar mean difference sqaure']=(df_currency['Dollars']-np.mean(df_currency['Dollars']))**2
df_currency['inr mean difference square']=(df_currency['INR']-np.mean(df_currency['INR']))**2

In [136]:
df_currency

   Dollars  INR  dollar mean difference sqaure  inr mean difference square
0        1   73                          20.25                   107912.25
1        2  146                          12.25                    65280.25
2        3  219                           6.25                    33306.25
3        4  292                           2.25                    11990.25
4        5  365                           0.25                     1332.25
5        6  438                           0.25                     1332.25
6        7  511                           2.25                    11990.25
7        8  584                           6.25                    33306.25
8        9  657                          12.25                    65280.25
9       10  730                          20.25                   107912.25

In [149]:
#variance
vari=sum(df_currency['dollar mean difference sqaure'])/len(np.mean(df_currency['Dollars']))

TypeError: object of type 'float' has no len()

In [147]:
#standard deviation
ste=np.sqrt(vari)

In [148]:
ste

9.082951062292475

In [152]:
#covariance

dmean=np.mean(df_currency['Dollars'])
dinr=np.mean(df_currency['INR'])

In [153]:
dmean,dinr

(5.5, 401.5)

In [156]:
df_currency['dollar mean difference']=df_currency['Dollars']-dmean
df_currency['inr mean difference']=df_currency['INR']-dinr

In [157]:
df_currency

,Dollars,INR,dollar mean difference sqaure,inr mean difference square,dollar mean difference,inr mean difference
0,1,73,20.25,107912.25,-4.5,-328.5
1,2,146,12.25,65280.25,-3.5,-255.5
2,3,219,6.25,33306.25,-2.5,-182.5
3,4,292,2.25,11990.25,-1.5,-109.5
4,5,365,0.25,1332.25,-0.5,-36.5
5,6,438,0.25,1332.25,0.5,36.5
6,7,511,2.25,11990.25,1.5,109.5
7,8,584,6.25,33306.25,2.5,182.5
8,9,657,12.25,65280.25,3.5,255.5
9,10,730,20.25,107912.25,4.5,328.5

In [161]:
covi=sum(df_currency['dollar mean difference']*df_currency['inr mean difference'])/len(df_currency['INR']-1)
#cov=sum(df_currency['dollar mean difference']*df_currency['dinr mean difference'])/len(df_currency['INR']-1)

In [162]:
covi

602.25

In [163]:
df_currency.corr()

,Dollars,INR,dollar mean difference sqaure,inr mean difference square,dollar mean difference,inr mean difference
Dollars,1.0,1.0,0.0,0.0,1.0,1.0
INR,1.0,1.0,0.0,0.0,1.0,1.0
dollar mean difference sqaure,0.0,0.0,1.0,1.0,0.0,0.0
inr mean difference square,0.0,0.0,1.0,1.0,0.0,0.0
dollar mean difference,1.0,1.0,0.0,0.0,1.0,1.0
inr mean difference,1.0,1.0,0.0,0.0,1.0,1.0

In [164]:
df_currency.cov()

,Dollars,INR,dollar mean difference sqaure,inr mean difference square,dollar mean difference,inr mean difference
Dollars,9.166667,669.166667,0.000000,0.000000e+00,9.166667,669.166667
INR,669.166667,48849.166667,0.000000,0.000000e+00,669.166667,48849.166667
dollar mean difference sqaure,0.000000,0.000000,58.666667,3.126347e+05,0.000000,0.000000
inr mean difference square,0.000000,0.000000,312634.666667,1.666030e+09,0.000000,0.000000
dollar mean difference,9.166667,669.166667,0.000000,0.000000e+00,9.166667,669.166667
inr mean difference,669.166667,48849.166667,0.000000,0.000000e+00,669.166667,48849.166667

In [165]:
d={'uid':[100,101,102],'uname':['rohit','karan','himanshu'],'age':[22,25,21]}

In [168]:
df=pd.DataFrame(d)
df

   uid     uname  age
0  100     rohit   22
1  101     karan   25
2  102  himanshu   21

In [169]:
d2={'uid':[103,100,105],'clg':['abn','srm','pec'],'city':['dehradun','delhi','shimla']}

In [170]:
df2=pd.DataFrame(d2)
df2

   uid  clg      city
0  103  abn  dehradun
1  100  srm     delhi
2  105  pec    shimla

In [171]:
df_inner=pd.merge(df,df2,how='inner')
df_inner

   uid  uname  age  clg   city
0  100  rohit   22  srm  delhi

In [179]:
df_outer=pd.merge(df,df2,how='outer',on='uid')
df_outer

   uid     uname   age  clg      city
0  100     rohit  22.0  srm     delhi
1  101     karan  25.0  NaN       NaN
2  102  himanshu  21.0  NaN       NaN
3  103       NaN   NaN  abn  dehradun
4  105       NaN   NaN  pec    shimla

In [181]:
df_left=pd.merge(df,df2,how='left',on='uid')
df_left

   uid     uname  age  clg   city
0  100     rohit   22  srm  delhi
1  101     karan   25  NaN    NaN
2  102  himanshu   21  NaN    NaN

In [182]:
df_right=pd.merge(df,df2,how='right',on='uid')
df_right

   uid  uname   age  clg      city
0  103    NaN   NaN  abn  dehradun
1  100  rohit  22.0  srm     delhi
2  105    NaN   NaN  pec    shimla

In [184]:
df_outer

   uid     uname   age  clg      city
0  100     rohit  22.0  srm     delhi
1  101     karan  25.0  NaN       NaN
2  102  himanshu  21.0  NaN       NaN
3  103       NaN   NaN  abn  dehradun
4  105       NaN   NaN  pec    shimla

In [185]:
df_ffil=df_outer.fillna(method='ffill')
df_ffil

   uid     uname   age  clg      city
0  100     rohit  22.0  srm     delhi
1  101     karan  25.0  srm     delhi
2  102  himanshu  21.0  srm     delhi
3  103  himanshu  21.0  abn  dehradun
4  105  himanshu  21.0  pec    shimla

In [186]:
df_bfil=df_outer.fillna(method='bfill')
df_bfil

   uid     uname   age  clg      city
0  100     rohit  22.0  srm     delhi
1  101     karan  25.0  abn  dehradun
2  102  himanshu  21.0  abn  dehradun
3  103       NaN   NaN  abn  dehradun
4  105       NaN   NaN  pec    shimla

In [188]:
d_val=df_outer.fillna(value='no data')
d_val

   uid     uname      age      clg      city
0  100     rohit       22      srm     delhi
1  101     karan       25  no data   no data
2  102  himanshu       21  no data   no data
3  103   no data  no data      abn  dehradun
4  105   no data  no data      pec    shimla

In [189]:
d_ml=df_outer.fillna(value={'uname':'no name given','age':'no age required','clg':'no clg','city':'no city'})

In [190]:
d_ml

   uid          uname              age     clg      city
0  100          rohit               22     srm     delhi
1  101          karan               25  no clg   no city
2  102       himanshu               21  no clg   no city
3  103  no name given  no age required     abn  dehradun
4  105  no name given  no age required     pec    shimla

In [191]:
d_n=df_outer.fillna(value={'age':np.mean(df_outer['age'])})

In [192]:
d_n

   uid     uname        age  clg      city
0  100     rohit  22.000000  srm     delhi
1  101     karan  25.000000  NaN       NaN
2  102  himanshu  21.000000  NaN       NaN
3  103       NaN  22.666667  abn  dehradun
4  105       NaN  22.666667  pec    shimla

In [193]:
d_med=df_outer.fillna(value={'age':np.median(df_outer['age'])})
d_med

   uid     uname   age  clg      city
0  100     rohit  22.0  srm     delhi
1  101     karan  25.0  NaN       NaN
2  102  himanshu  21.0  NaN       NaN
3  103       NaN   NaN  abn  dehradun
4  105       NaN   NaN  pec    shimla

In [194]:
d_in=df_outer.sort_index(ascending=False)

In [195]:
d_in

   uid     uname   age  clg      city
4  105       NaN   NaN  pec    shimla
3  103       NaN   NaN  abn  dehradun
2  102  himanshu  21.0  NaN       NaN
1  101     karan  25.0  NaN       NaN
0  100     rohit  22.0  srm     delhi

In [208]:
d_va=df_outer.sort_values('uname',ascending=False,axis=1)
d_va

KeyError: 'uname'

NameError: name 'd_va' is not defined